<a href="https://colab.research.google.com/github/helloKH/Psypy/blob/master/Psypy_Data%20Load%20%26%20Preparations(Chapter%206%20~7).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Psypy 6회차 
- 데이터 로딩과 저장, 파일의 형식(Chapter 6) 
- 데이터 정제 및 준비(Chapter 7)
- 참고자료: Python for Data Analysis 2nd.

In [128]:
!python -V

Python 3.6.9

#### 0. Google Drive와 연결하여 데이터 업로드해두기
- 참고 문서 링크: https://www.marktechpost.com/2019/06/07/how-to-connect-google-colab-with-google-drive/

In [196]:
from google.colab import drive
drive.mount('/content/gdrive')

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

#### URL로 가서 authorization code를 아래 code 입력란에 copy and paste. 마운트 위치는 /content/gdrive/My Drive/ 이렇게 됨.

In [197]:
!ls '/content/gdrive/My Drive/' # 유닉스 명령어 ls를 사용하여 폴더에 있는 파일 리스트를 확인 가능

 Aimmed  'Colab Notebooks'   psypy   pydata-book

#### 자신의 구글 드라이브에 디렉토리를 만들어서 거기에 필요한 파일들을 업로드
- 교재에서 사용되는 파일들은 아래 링크에 존재
- https://github.com/wesm/pydata-book/tree/2nd-edition/examples

In [199]:
import os
os.getcwd()
os.chdir('/content/gdrive/My Drive/pydata-book') #경로 변경
os.getcwd()

'/content/gdrive/My Drive/pydata-book'

In [0]:
import urllib.request

url = 'https://raw.githubusercontent.com/wesm/pydata-book/2nd-edition/examples/ex1.csv'
file_name = "examples/ex1.csv" 
with urllib.request.urlopen(url) as r:
  doc = r.read()
  with open(file_name, "wb") as f:
    f.write(doc)

In [202]:
# 제대로 만들어서 업로드했으면 다음처럼 확인할 수 있다.
!ls '/content/gdrive/My Drive/pydata-book'

appa.ipynb  ch05.ipynb	ch09.ipynb  ch13.ipynb	examples
ch02.ipynb  ch06.ipynb	ch10.ipynb  ch14.ipynb	README.md
ch03.ipynb  ch07.ipynb	ch11.ipynb  COPYING	requirements.txt
ch04.ipynb  ch08.ipynb	ch12.ipynb  datasets

In [203]:
# 실습을 위한 소스와 데이터가 있는 저장소를 클로닝해서 colab과 동기화하는 방법을 사용.
# 지금은 클로닝되어 있지 않음
%ls

appa.ipynb  ch05.ipynb  ch09.ipynb  ch13.ipynb  examples/
ch02.ipynb  ch06.ipynb  ch10.ipynb  ch14.ipynb  README.md
ch03.ipynb  ch07.ipynb  ch11.ipynb  COPYING     requirements.txt
ch04.ipynb  ch08.ipynb  ch12.ipynb  datasets/

In [204]:
# 저장소 가져옴
!git clone https://github.com/wesm/pydata-book.git

Cloning into 'pydata-book'...
remote: Enumerating objects: 431, done.
remote: Total 431 (delta 0), reused 0 (delta 0), pack-reused 431
Receiving objects: 100% (431/431), 40.54 MiB | 11.03 MiB/s, done.
Resolving deltas: 100% (132/132), done.
Checking out files: 100% (210/210), done.

In [205]:
# 코드&데이터 디렉토리 확인
%ls

appa.ipynb  ch05.ipynb  ch09.ipynb  ch13.ipynb  examples/
ch02.ipynb  ch06.ipynb  ch10.ipynb  ch14.ipynb  pydata-book/
ch03.ipynb  ch07.ipynb  ch11.ipynb  COPYING     README.md
ch04.ipynb  ch08.ipynb  ch12.ipynb  datasets/   requirements.txt

In [206]:
#colab의 실행 위치를 examples 디렉토리 내부로 옮기자
%cd examples

/content/gdrive/My Drive/pydata-book/examples

In [207]:
os.getcwd()

'/content/gdrive/My Drive/pydata-book/examples'

In [208]:
%ls

array_ex.txt    ex4.csv                     macrodata.csv   test_file.csv
csv_mindex.csv  ex5.csv                     out.csv         tips.csv
ex1.csv         ex6.csv                     segismundo.txt  tseries.csv
ex1.xlsx        ex7.csv                     spx.csv         volume.csv
ex2.csv         example.json                stinkbug.png    yahoo_price.pkl
ex3.csv         fdic_failed_bank_list.html  stock_px_2.csv  yahoo_volume.pkl
ex3.txt         ipython_bug.py              stock_px.csv

In [209]:
%cat ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

### 6 데이터 로딩과 저장, 파일형식

#### 6.1 텍스트파일에서 데이터 읽고 쓰기

In [0]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [211]:
!cat ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [212]:
# 설정된 폴더 내에서 data를 직접 불러온다
df = pd.read_csv('ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [213]:
#read_table 에 구분자로 쉼표를 지정해서 읽어올 수 있다
pd.read_table('ex1.csv', sep = ',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

- 파일 컬럼에 이름이 없는 경우

In [214]:
pd.read_table('ex2.csv')

    1,2,3,4,hello
0   5,6,7,8,world
1  9,10,11,12,foo

- pandas 가 자동으로 컬럼 이름 생성하게 만들거나, 이름 지정하기

In [215]:
pd.read_csv('ex2.csv', header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [216]:
pd.read_csv('ex2.csv', names = ['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [217]:
names = ['a', 'b', 'c', 'd', 'message']
pd.read_csv('ex2.csv', names = names, index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

- 계층적 색인을 지정하기 위해 컬럼 번호나 이름의 리스트를 넘기기

In [218]:
parsed = pd.read_csv('csv_mindex.csv', index_col = ['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

- 고정된 구분자 없이 공백이나 다른 패턴으로 필드를 구분한 경우
  - 정규표현식으로 고치기

In [219]:
result = pd.read_table('ex3.txt', sep = '\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

- 누락된 값 확인하기

In [220]:
result = pd.read_csv('ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [221]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

- na-values 옵션은 리스트나 문자열 집합을 받아서 누락된 값을 처리한다

In [222]:
result = pd.read_csv('ex5.csv', na_values = ['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [223]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}
pd.read_csv('ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

#### 6.1.1 텍스트파일 조금씩 읽어오기

In [224]:
result = pd.read_csv('ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [225]:
pd.read_csv('ex6.csv', nrows = 5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

- chunksize 옵션으로 row 개수를 나눠서 읽을 수 있다

In [0]:
chunker = pd.read_csv('ex6.csv', chunksize= 1000)

# TextParser 객체를 이용해 chunksize에 따라 분리된 파일들을 순회 가능
# ex6.csv 파일을 순회하면서 key 값 세어보기

tot = pd.Series([])

for piece in chunker:
  tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending = False)

In [227]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

#### 6.1.2 데이터를 텍스트 형식으로 기록
- 읽어오기와 마찬가지로 데이터를 구분자로 내보내는 것도 가능

In [228]:
data = pd.read_csv('ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

- to.csv 메서드를 이용하면 데이터를 쉼표로 구분된 형식으로 파일에 쓸 수 있음

In [229]:
data.to_csv('ex5.csv')
!cat out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

- 다른 구분자도 가능(콘솔에서 확인 가능하도록 실제 파일로 기록하지 않고, sys.stdout에 기록)

In [230]:
import sys

data.to_csv(sys.stdout, sep = '|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

- 결과에서 누락된 값은 빈 문자열로 나타나는데, 원하는 값으로 지정 가능

In [231]:
data.to_csv(sys.stdout, na_rep = 'NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

- row, column 이름 포함하지 않기

In [232]:
data.to_csv(sys.stdout, index = False, header = False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

- 일부기록 혹은 순서 지정

In [233]:
data.to_csv(sys.stdout, index = False, columns = ['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

#### 6.1.3 구분자 형식 다루기

- 파일을 읽듯이 reader을 순회하면 큰따옴표가 제거된 튜플 획득 가능

In [234]:
data = pd.read_csv('ex7.csv')
data

   a  b  c
0  1  2  3
1  1  2  3

- 구분자가 한 글자인 파일은 파이썬 내장 csv 모듈로 처리할 수 있는데, 열려진 파일 객체를 csv.reader로 넘기면 됨

In [235]:
import csv
f = open('ex7.csv')
reader = csv.reader(f)

for line in reader:
  print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

- 파일을 읽어줄 단위를 리스트로 저장하고, 헤더와 데이터를 구분한다

In [0]:
with open('ex7.csv') as f:
  lines = list(csv.reader(f))

header, values = lines[0], lines[1:]

- 사전 표기법과 row를 컬럼으로 전치해주는 zip(*values)를 이용하여 데이터 컬럼 사전을 만들 수 있다

In [237]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

#### 6.1.4 JSON 데이터 
- JSON은 웹브라이저와 다른 애플리케이션이 HTTP 요청으로 데이터를 보낼 때 널리 사용하는 표준 파일 형식. JSON은 CSV 같은 표 형식보다 더 유연함

In [0]:
#예시
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

- JSON은 일부를 제외하면 파이썬 코드와 유사. 객체의 키는 반드시 문자열이어야 함
- 파이썬 표준 라이브러리인 json를 통해 다룰 수 있음

In [239]:
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 30, 'name': 'Scott', 'pets': ['Zeus', 'Zuko']},
  {'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]}

- json.dumps는 파이썬 객체를 json 형태로 변환

In [240]:
asjson = json.dumps(result)
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

- 객체의 리스트를 사전을 담고 있는 리스트로 변환, DataFrame 생성자로 넘기고 데이터 필드 선택 가능

In [241]:
siblings = pd.DataFrame(result['siblings'], columns = ['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [242]:
!cat example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

- 별다른 옵션이 없을 경우 pd.read_json는 JSON 배열에 담긴 각 객체를 테이블의 row로 간주

In [243]:
data = pd.read_json('example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

- pandas의 데이터를 json으로 저장하는 방법 중 하나는 Series 혹은 to_json 함수를 이용하는 것

In [244]:
print(data.to_json())
print(data.to_json(orient='records'))

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}
[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

#### 6.1.5 XML 과 HTML: 웹 스크래핑

- 파이썬에는 lxml, Beautiful Soup, html5lib 과 같은 HTML과 XML 형식의 데이터를 읽고 쓸 수 있는 라이브러리 존재. 
- lxml은 가장 빠르게 동작하고, 꺠진 HTML, XML 파일도 처리해줌
- read_html은 lxml, Beautiful Soup 같은 라이브러리를 통해 자동으로 HTML을 파싱하여 DataFrame으로 변환해줌

- 미연방예금공사에서 부도은행을 보여주는 data

In [245]:
tables = pd.read_html('fdic_failed_bank_list.html')
print(len(tables))
failures = tables[0]
failures.head()

1

                      Bank Name  ...       Updated Date
0                   Allied Bank  ...  November 17, 2016
1  The Woodbury Banking Company  ...  November 17, 2016
2        First CornerStone Bank  ...  September 6, 2016
3            Trust Company Bank  ...  September 6, 2016
4    North Milwaukee State Bank  ...      June 16, 2016

[5 rows x 7 columns]

- 데이터 정제 및 연도별 부도은행 수

In [246]:
print(data.to_json())
print(data.to_json(orient='records'))

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}
[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

- lxml.objectify를 통해 XML 파싱하기
  - XML은 계층적 구조와 메타데이터를 포함한 중접된 데이터 구조를 지원
  - 뉴욕 MTA(버스, 지하철 운영 자료) 예시

In [0]:
# examples에는 Performance_MNR.xml가 없다
os.chdir('/content/gdrive/My Drive/pydata-book') #윗 단으로 경로 변경

In [0]:
from lxml import objectify

path = 'datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

- root.INDICATOR를 이용해서 모든 <INDICATOR> 엘리먼트를 끄집어낼 수 있다. 각 항목에 대한 몇몇 태그는 제외하고 태그 이름을 키값으로 하는 사전을 만들 수 있다

In [0]:
data = []

skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
               'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

- 사전 리스트를 DataFrame으로 전환

In [258]:
perf = pd.DataFrame(data)
perf.head()

            AGENCY_NAME  ... MONTHLY_ACTUAL
0  Metro-North Railroad  ...           96.9
1  Metro-North Railroad  ...             95
2  Metro-North Railroad  ...           96.9
3  Metro-North Railroad  ...           98.3
4  Metro-North Railroad  ...           95.8

[5 rows x 12 columns]

- XML 데이터는 예제보다 더 복잡. 유효한 XML 형식인 HTML의 a 태그를 생각하면 됨

In [0]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [263]:
root
root.get('href')
root.text

'Google'

#### 6.2 이진 데이터 형식